#+TITLE: Emacs Configuration
#+AUTHOR: Parikshit Machwe
#+STARTUP: outline
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./style.css">

** Basics
Some basic settings first of all.

*NOTE:* The source code blocks will not have background when the
 language is specified due to a bug. More [[http://stackoverflow.com/questions/26290924/fontify-r-code-blocks-in-org-mode-8][here]]. Original post is
 [[http://orgmode.org/worg/org-contrib/babel/examples/fontify-src-code-blocks.html][here]].

#+BEGIN_SRC emacs-lisp
  ;; add global settings in a hook
  ;; add org-mode specific normally

  ;(use-package org
  ;  :diminish org-indent-mode)

  ;(diminish 'org-indent-mode)

  ;; disabling org-indent-mode and auto-fill-mode
  (defun pm/org-mode-hooks()
    (org-indent-mode 1)
    ;(auto-fill-mode 1)
    (bind-key "C-c l" 'org-store-link)
    (bind-key "C-c a" 'org-agenda))

  (add-hook 'org-mode-hook 'pm/org-mode-hooks)

  ;; Do not subscript for _ and superscript for ^
  (setq org-use-sub-superscripts nil)

  ;; Beautify
  (custom-set-faces
   '(org-level-1 ((t (:inherit outline-1 :height 1.20))))
   '(org-level-2 ((t (:inherit outline-2 :height 1.15))))
   '(org-level-3 ((t (:inherit outline-3 :height 1.10))))
   '(org-level-4 ((t (:inherit outline-4 :height 1.05))))
   '(org-document-title ((t (:underline t :weight bold :height 1.3)))))

  ;; Org-directory
  (setq org-directory "~/org")
  (setq org-agenda-files '("~/org"))

  ;; Use unicode char instead of ...
  (when window-system
    (setq org-ellipsis "…"))

  ;(defface org-block-begin-line
  ;  '((t (:underline "#A7A6AA" :foreground "#008ED1" :background "#EAEAFF")))
  ;  "Face used for the line delimiting the begin of source blocks.")
  ;
  ;(defface org-block
  ;  '((t (:background "#000000")))
  ;  "Face used for the source block background.")
  ;
  ;(defface org-block-end-line
  ;  '((t (:overline "#A7A6AA" :foreground "#008ED1" :background "#EAEAFF")))
  ;  "Face used for the line delimiting the end of source blocks.")

#+END_SRC

#+RESULTS:
: …

** Org Capture and Refile

#+BEGIN_SRC emacs-lisp
  ;; Setup a shortcut for org-capture

  (setq org-default-notes-file (concat org-directory "/notes.org"))
  (bind-key "C-c c" 'org-capture)
  (setq org-refile-targets '((org-agenda-files . (:maxlevel . 6))))
#+END_SRC

#+RESULTS:
: ((org-agenda-files :maxlevel . 6))

* Custom Shortcuts

The common commands are mapped to single key shortcuts.

Note: Some of the keybindings of the form C-<special char>
(e.g. C-.). Apparantly, the terminal emulators pass the ASCII value of
the character minus 64. For some special character this leads to
negative values and hence the terminal emulators do not understand
these.

Hence, converting such keybindings to the form C-c <special char> or
M-<char>.

Note: A good suggestion is to create a minor-mode and change create
the custom keybindings in the minor mode. This should help avoid any
clashes and also all the custom keybindings could be turned off in one
go with the minor mode. This idea is taken from [[http://stackoverflow.com/questions/683425/globally-override-key-binding-in-emacs][here]].

Another good suggestion is to use C-. as a prefix (in the same way as
C-c and define many more keybindings). These might not work in some
terminals. Some other prefixes that
could be used are C-m which is also bound to
newline-and-indent. Others are C-h <j|o|q|u|x|y|z> as these
keybindings are unused. Using C-. for now.

Using "h" for help, "c" for personal configurations.

Some other free combinations are: C-', C-".

#+BEGIN_SRC emacs-lisp

  ;; use bind-key to bind personal keys

  (bind-keys*
   ("<f5>" . shell)
   ("S-<f5>" . eshell)
   ("C-c M-!" . eshell-command))

  ;; Search
  (bind-keys*
   ("C-s" . isearch-forward-regexp)
   ("C-r" . isearch-backward-regexp)
   ("C-M-s" . isearch-forward)
   ("C-M-r" . isearch-backward)
   ("C-," . isearch-forward-symbol-at-point)
   ("C-c ," . highlight-symbol-at-point)
   ("C-c C-," . unhighlight-regexp))

  ;; Buffer related
  (bind-keys*
   ("M-j" . counsel-find-file)
   ("M-J" . ido-find-file-other-window)
   ("M-o" . ivy-switch-buffer)
   ("M-k" . kill-buffer-and-window)
   ("M-K" . kill-buffer))

  ;; Avy - again due to org-mode pollution
  (bind-keys*
   ("C-;" . avy-goto-word-1)
   ("C-c ;" . avy-goto-char)
   ("M-g g" . avy-goto-line))

  ;; Free up C-h for backspace
  (bind-key* "C-?" help-map)

  ;; Use C-h for backspace as it is more ergonomic
  (bind-keys*
   ("C-h" . backward-delete-char)
   ("M-h" . backward-kill-word))

  ;; Window movement
  (bind-keys*
   ("C-x <up>" . windmove-up)
   ("C-x <down>" . windmove-down)
   ("C-x <left>" . windmove-left)
   ("C-x <right>" . windmove-right))

  ;; Window Killing
  ;; C-x 1 and C-x 0 are a bit cumbersome
  (bind-keys*
   ("C-x ," . delete-other-windows)
   ("C-x ." . delete-window))

  ;; Switch windows quickly
  ;(bind-keys*
   ;("C-. C-." . ace-window))

  (bind-keys*
   ("C-. h v" . view-echo-area-messages)
   ("C-. h c" . (lambda() (switch-to-buffer "*Compilation*"))))

  ;; Simple utils
  (defvar emacs-help-dir "~/.emacs.d/help/"
    "Save help files here.")

  (bind-keys*
   ("C-. h S" . (lambda()
                  (interactive)
                  (find-file-other-window
                   (concat emacs-help-dir "smartparens.txt"))))
   ("C-. h M" . (lambda()
                  (interactive)
                  (ind-file-other-window
                   (concat emacs-help-dir "magit.org"))))
   ("C-. h C" . (lambda()
                  (interactive)
                  (find-file-other-window
                   (concat user-emacs-directory "config.org"))))
   ("C-. c f" . (lambda(font size)
                  (interactive "sFont: \nsSize: ")
                  (set-default-font (concat font " " size)))))


#+END_SRC

#+RESULTS:
| lambda | (font size) | (interactive sFont: \nsSize: ) | (set-default-font (concat font   size)) |

